:PROPERTIES:
:alias:    C
:ID:       B55CCD9A-F769-4369-AB9E-AD1F64A3B9C6
:END:
#+title: c

The C language.

C holds a pretty entrenched place in programming.
While it rarely makes sense for my professional use, It has popped up
occasionally (such as extending nginx) and I'm fairly likely to use it
with something like [[id:356F5786-6AFC-4BDE-95A6-C5B0627726EF][cproc]] for a lean setup.

#+begin_src C :includes <stdio.h> :results output
  printf("Hello, World!");
#+end_src

#+RESULTS:
: Hello, World!
